final-benchmarks/ec2.m3.2xl.1.uniform95.1/20/ycsb-results
java -cp postgresql-9.4.1212.jre7.jar:/home/ubuntu/ycsb/jdbc-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jdbc-binding-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/core-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/commons-pool-1.5.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform95 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.33.156.214:26267/test,jdbc:postgresql://35.166.146.241:26267/test,jdbc:postgresql://35.164.175.207:26267/test,jdbc:postgresql://52.11.22.98:26267/test,jdbc:postgresql://35.166.128.95:26267/test -s -threads 20 -t
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform95 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.33.156.214:26267/test,jdbc:postgresql://35.166.146.241:26267/test,jdbc:postgresql://35.164.175.207:26267/test,jdbc:postgresql://52.11.22.98:26267/test,jdbc:postgresql://35.166.128.95:26267/test -s -threads 20 -tYCSB Client 0.13.0-SNAPSHOT

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
[...]
2017-03-11 04:43:52:459 0 sec: 0 operations; est completion in 0 seconds 
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
Adding shard node URL: jdbc:postgresql://52.33.156.214:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
Adding shard node URL: jdbc:postgresql://35.166.146.241:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.164.175.207:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.11.22.98:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.166.128.95:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-03-11 04:44:00:658 8 sec: 100000 operations; 12156.58 current ops/sec; [READ: Count=95023, Max=204543, Min=808, Avg=1405.96, 90=1729, 99=6875, 99.9=13887, 99.99=27311] [CLEANUP: Count=20, Max=414, Min=120, Avg=161.5, 90=188, 99=414, 99.9=414, 99.99=414] [UPDATE: Count=4977, Max=23615, Min=2138, Avg=4803.91, 90=8583, 99=15391, 99.9=19151, 99.99=23615] 
[OVERALL], RunTime(ms), 8226.0
[OVERALL], Throughput(ops/sec), 12156.576707999027
[TOTAL_GCS_PS_Scavenge], Count, 1.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 5.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.06078288353999514
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1.0
[TOTAL_GC_TIME], Time(ms), 5.0
[TOTAL_GC_TIME_%], Time(%), 0.06078288353999514
[READ], Operations, 95023.0
[READ], AverageLatency(us), 1405.961293581554
[READ], MinLatency(us), 808.0
[READ], MaxLatency(us), 204543.0
[READ], 95thPercentileLatency(us), 3383.0
[READ], 99thPercentileLatency(us), 6875.0
[READ], Return=OK, 95023
[CLEANUP], Operations, 20.0
[CLEANUP], AverageLatency(us), 161.5
[CLEANUP], MinLatency(us), 120.0
[CLEANUP], MaxLatency(us), 414.0
[CLEANUP], 95thPercentileLatency(us), 218.0
[CLEANUP], 99thPercentileLatency(us), 414.0
[UPDATE], Operations, 4977.0
[UPDATE], AverageLatency(us), 4803.906771147277
[UPDATE], MinLatency(us), 2138.0
[UPDATE], MaxLatency(us), 23615.0
[UPDATE], 95thPercentileLatency(us), 10903.0
[UPDATE], 99thPercentileLatency(us), 15391.0
[UPDATE], Return=OK, 4977